{
  "backend/main.mo": "Main Motoko actor implementing a wallet system with user profiles, credit minting/transfers, transaction history, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features related to investigating and fixing Internet Identity authorization flow issues, particularly incorrect redirect URLs to 'https://id.ai/#authorize'.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, hooks, pages, and utilities with focus on authentication flow, error handling, and performance optimizations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including primary, secondary, accent, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Bio Citadel Digital Wallet application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, lazy-loaded routes, QueryClient configuration, authentication flow, admin data prefetching, and profile setup modal integration.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and caffeine.ai attribution link with heart icon.",
  "frontend/src/components/Header.tsx": "Application header with Bio Citadel branding, user avatar/profile display, login/logout functionality with comprehensive error handling, detailed console logging, and toast notifications using error classification utilities.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component for new users to set up their profile by entering their name, using a form with validation and loading states that calls the useSaveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using @dfinity/auth-client, managing identity state and delegation validation throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, wallet balances, transactions, and admin operations with proper caching, error handling, and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a citadel-themed color palette (deep blue primary, gold accent) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context wrapping the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page component that displays user statistics, transaction ledger, and provides a form to mint credits to users, with optimized data fetching using memoization and skeleton loading states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that displays hero section with login button, features cards (security, work credits, community), and handles Internet Identity authentication with comprehensive error handling and user feedback via toast notifications.",
  "frontend/src/pages/PublicLedger.tsx": "Public ledger page that displays all Work Credits transactions (mints and transfers) in a scrollable table, mapping principals to user names and showing transaction details including ID, timestamp, type, participants, and amounts.",
  "frontend/src/pages/UserWallet.tsx": "User wallet page showing balance, transaction history, and transfer form with Principal ID validation, self-transfer prevention, insufficient balance checks, and clipboard copy functionality for the user's principal.",
  "frontend/src/utils/errorHandling.ts": "Error handling utilities that classify errors into types (network, configuration, delegation, user cancellation, unknown) and provide user-friendly messages with actionable guidance for each error category.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting and managing query parameters from both regular URLs and hash-based routing, with sessionStorage persistence and cleanup functions for maintaining state across navigation.",
  "frontend/src/vite-env.d.ts": "TypeScript declaration file defining Vite environment variable types for backend canister ID and optional Internet Identity URL configuration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for Bio Citadel Network (Work Credit issuance system) tracking version 7, documenting known Internet Identity login issues redirecting to id.ai/#authorize, and listing multiple features related to diagnosing and fixing authentication failures."
}