{
  "backend/main.mo": "Main Motoko actor implementing a wallet and credits system with user profiles, role-based access control (admin/user permissions), credit minting/transfers, transaction history, and admin dashboard functionality for managing users and viewing the ledger.",
  "feature_evidence.json": "Feature evidence report documenting two authentication-related features: pre-authentication validation checks with configuration logging, and environment-specific authentication initialization for Internet Identity settings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, hooks, pages, and utilities with details on authentication, data fetching, error handling, UI optimization, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a design system using OKLCH color space for light and dark themes, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and script reference to the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component configuring routing with TanStack Router, React Query client, lazy-loaded pages, authentication provider, theme provider, toast notifications, profile setup modal, and admin data prefetching on login.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with Bio Citadel branding, user avatar with initials and role badge, login/logout button with comprehensive error handling, logging, and user-friendly toast notifications for authentication failures.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to enter their name to set up their profile and access the Work Credits wallet. Uses form validation and displays loading states during profile creation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity login state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages authentication state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, wallet balances, transaction history, and admin operations. Handles caching, error handling, and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a citadel-themed UI using OKLCH color space. Defines light and dark mode color schemes with deep blue primary, gold accents, and semantic colors for success/destructive states.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for minting Work Credits to users, displaying statistics (total users, total minted credits), and showing recent transaction activity. Includes loading skeletons and uses memoization for performance optimization.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that displays hero section with logo, features cards (security, work credits, transparency), and a login button that uses Internet Identity authentication with comprehensive error handling and toast notifications.",
  "frontend/src/pages/PublicLedger.tsx": "Public ledger page that displays all Work Credits transactions (mints and transfers) in a scrollable table, showing transaction ID, timestamp, type, sender/recipient with user names, and amounts using data from transaction ledger and user registry queries.",
  "frontend/src/pages/UserWallet.tsx": "User wallet page that displays balance, transaction history, and a transfer form with Principal ID validation, self-transfer prevention, insufficient balance checks, and clipboard copy functionality for the user's own Principal ID.",
  "frontend/src/utils/authConfig.ts": "Authentication configuration utility that detects environment (development/production), validates and loads auth settings including derivationOrigin based on hostname, and provides diagnostic logging for troubleshooting Internet Identity authentication issues.",
  "frontend/src/utils/errorHandling.ts": "Error handling utilities that classify errors into types (network, configuration, delegation, user cancellation, unknown) and provide user-friendly messages with actionable guidance for consistent error presentation across the application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/vite-env.d.ts": "TypeScript declarations for Vite environment variables including backend canister ID, Internet Identity URL, derivation origin, and auth environment.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for Bio Citadel Network showing known Internet Identity login failures, existing features for authentication debugging, and architectural notes about Work Credit issuance system."
}