{
  "backend/main.mo": "Main Motoko actor implementing a Work Credits wallet system with user profiles, credit minting/transfers, transaction history, role-based access control (admin/user permissions), and wallet management functionality.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features related to Internet Identity authentication error handling, backend canister ID verification, and user-friendly error messaging with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files describing components for authentication, wallet management, admin dashboard, public ledger, error handling utilities, and optimized data fetching with React Query.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a design system using OKLCH color space for light and dark themes with primary, secondary, accent, and semantic colors.",
  "frontend/index.html": "HTML entry point for the Bio Citadel Digital Wallet application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, lazy-loaded routes, Internet Identity authentication integration, profile setup modal, admin data prefetching, and asset preloading for optimized performance.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with Bio Citadel branding, user authentication controls (login/logout), user profile display with avatar and role badge, comprehensive error handling with toast notifications, and detailed console logging for debugging authentication flows.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to enter their name to set up their profile and access their Work Credits wallet. Uses a form with name input and submit button, showing loading state during profile save.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes, and initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for the application, managing login/logout state, identity persistence, and delegation validation. Exports InternetIdentityProvider component and useInternetIdentity hook for accessing auth state and methods.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, roles, wallet balances, transaction history/ledger, and admin functions. Each hook uses the actor from useActor and includes proper caching, error handling, and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a citadel-themed color palette using OKLCH color space. Includes light and dark mode variants with deep blue primary colors, gold accents, and semantic colors for success/destructive states.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication. Renders the main App component with all necessary context providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for minting Work Credits to users, displaying statistics (total users, total minted credits), and showing recent transaction activity. Includes user selection dropdown, amount input, and loading skeletons with memoized computed values for performance.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that displays hero section with features and handles Internet Identity login with error classification and toast notifications.",
  "frontend/src/pages/PublicLedger.tsx": "Public ledger page that displays all Work Credits transactions (minting and transfers) in a table with user names and principals, using transaction and user data from backend queries.",
  "frontend/src/pages/UserWallet.tsx": "User wallet page showing balance, transaction history, and transfer form with validation for Principal IDs, self-transfers, and insufficient balance checks.",
  "frontend/src/utils/errorHandling.ts": "Error classification utility that categorizes errors into types (network, configuration, delegation, user cancellation, unknown) and provides user-friendly messages with actionable guidance.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting and persisting parameters from both regular query strings and hash-based routing, with sessionStorage support for cross-navigation persistence.",
  "frontend/src/vite-env.d.ts": "TypeScript declarations for Vite environment variables including backend canister ID and Internet Identity URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for Bio Citadel Network tracking Internet Identity authentication issues, existing features for diagnosing login failures, and pending feature requests for backend canister ID and identity provider URL configuration."
}