{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity Authentication Configuration",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Remove hardcoded Internet Identity provider URLs and use @dfinity/auth-client defaults",
      "acceptanceCriteria": [
        "The identityProvider parameter in AuthClient.create() is removed or set to undefined",
        "The auth-client library automatically discovers the correct Internet Identity service URL",
        "No references to 'id.ai' or custom identity provider URLs remain in the authentication flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.tsx",
          "operation": "modify",
          "description": "Remove any hardcoded identityProvider URL parameter from the AuthClient.create() call and ensure it relies on the library's default configuration for Internet Identity service discovery. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Correct derivationOrigin configuration for production frontend canister",
      "acceptanceCriteria": [
        "The derivationOrigin uses the correct format for Internet Computer frontend canisters",
        "The derivationOrigin matches the actual deployment URL where the application is hosted",
        "Authentication completes successfully without redirecting to incorrect domains"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.tsx",
          "operation": "modify",
          "description": "Update the derivationOrigin configuration in the login method to use the correct Internet Computer frontend canister URL format (https://<canister-id>.icp0.io or https://<canister-id>.ic0.app) based on the deployment environment. Ensure it matches the actual production deployment URL."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add pre-authentication validation and configuration logging",
      "acceptanceCriteria": [
        "Configuration parameters are logged to console before login attempts",
        "Any misconfiguration is detected and reported with actionable error messages",
        "Users receive clear feedback if the authentication system is not properly configured"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.tsx",
          "operation": "modify",
          "description": "Add a validation function that logs all AuthClient configuration parameters (derivationOrigin, identityProvider, maxTimeToLive) to the console before initiating login. Include checks for common misconfigurations and provide clear error messages with actionable guidance if issues are detected."
        },
        {
          "path": "frontend/src/utils/authConfig.ts",
          "operation": "create",
          "description": "Create a utility module that provides configuration validation functions for Internet Identity authentication. Include functions to validate derivationOrigin format, check for environment-specific settings, and generate detailed diagnostic logs for troubleshooting authentication issues."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Implement environment-specific authentication configuration loading",
      "acceptanceCriteria": [
        "Environment variables correctly distinguish between local development and production deployment",
        "Production builds use production-appropriate Internet Identity configuration",
        "Configuration loading is verified and logged during application initialization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/vite-env.d.ts",
          "operation": "modify",
          "description": "Add TypeScript type definitions for new environment variables related to Internet Identity configuration, including VITE_DERIVATION_ORIGIN and VITE_AUTH_ENVIRONMENT to distinguish between development and production environments."
        },
        {
          "path": "frontend/src/utils/authConfig.ts",
          "operation": "modify",
          "description": "Add environment-specific configuration loading logic that reads from environment variables to determine the correct derivationOrigin and other authentication settings. Include logic to detect whether the app is running in local development or production deployment and apply appropriate configurations. Log the loaded configuration during application initialization for verification."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.tsx",
          "operation": "modify",
          "description": "Integrate the environment-specific configuration loader from authConfig.ts into the authentication flow. Use the loaded configuration when initializing AuthClient and logging in. Ensure all configuration parameters are logged for debugging and verification purposes."
        }
      ]
    }
  ]
}